PiBoxY/msp430ware/examples/boards/MSP-EXP430FR5994/MSP-EXP430FR5994_Software_Examples/Firmware/Source/BOOSTXL-AUDIO_430BOOST-SHARP96_FFT_FIR_LEA_MSP430FR5994/src/grlib/LcdDriver/Sharp96x96.c
/* --COPYRIGHT--,BSD
 * Copyright (c) 2016, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * --/COPYRIGHT--*/

//*****************************************************************************
//
// IMPORTANT NOTE: The following driver file supports using either RAM or
// non-volatile memory(Flash or FRAM) to store the LCD DisplayBuffer.
//
//*****************************************************************************

//*****************************************************************************
//
// Sharp96x96.c
//
//*****************************************************************************
//
//! \addtogroup display_api
//! @{
//
//*****************************************************************************

#include "grlib.h"
#include "Sharp96x96.h"
#include <msp430.h>
#include <stdint.h>
#include "HAL_MSP_EXP430FR5994_Sharp96x96.h"
#include "driverlib.h"

const uint8_t reverse_data[] = {0x0, 0x8, 0x4, 0xC, 0x2, 0xA, 0x6, 0xE, 0x1,
                                0x9, 0x5, 0xD, 0x3, 0xB, 0x7, 0xF};
uint8_t VCOMbit = 0x40;
uint8_t flagSendToggleVCOMCommand = 0;

static void Sharp96x96_InitializeDisplayBuffer(void *pvDisplayData,
                                               uint8_t ucValue);
static uint8_t Sharp96x96_reverse(uint8_t x);

//*****************************************************************************
//
// If flash is used as non-volatile memory, the DisplayBuffer will have 32 extra
// vertical lines to create a buffer size which is a multiple of 512 Byte
// (this is the default size of flash memory segments in MSP430 device). It is
// required that the display buffer is a multiple of 512 Bytes to be able to
// initialize the buffer using the FLASH segment erase feature of the FLASH
// controller.
//
//*****************************************************************************

#ifndef NON_VOLATILE_MEMORY_BUFFER
uint8_t DisplayBuffer[LCD_VERTICAL_MAX][LCD_HORIZONTAL_MAX / 8];
#else
#ifdef __ICC430__
__persistent uint8_t DisplayBuffer[LCD_VERTICAL_MAX + 32][LCD_HORIZONTAL_MAX /
                                                          8];
#elif defined(__TI_COMPILER_VERSION__)
#pragma PERSISTENT(DisplayBuffer)
uint8_t DisplayBuffer[LCD_VERTICAL_MAX + 32][LCD_HORIZONTAL_MAX / 8] = {0};
#else
uint8_t DisplayBuffer[LCD_VERTICAL_MAX + 32][LCD_HORIZONTAL_MAX / 8];
#endif //__ICC430__
#endif //NON_VOLATILE_MEMORY_BUFFER

//*****************************************************************************
//
//! Initializes the display driver.
//!
//! This function initializes the Sharp96x96 display controller preparing it to
//! display data.
//!
//! \return None.
//
//*****************************************************************************
void Sharp96x96_initDisplay(void)
{
    HAL_LCD_initDisplay();
}

//*****************************************************************************
//
//! Send toggle VCOM command.
//!
//! This function toggles the state of VCOM which prevents a DC bias from being
//! built up within the panel.
//!
//! \return None.
//
//*****************************************************************************
void Sharp96x96_SendToggleVCOMCommand()
{
    VCOMbit ^= SHARP_VCOM_TOGGLE_BIT;

    if(SHARP_SEND_TOGGLE_VCOM_COMMAND == flagSendToggleVCOMCommand)
    {
        //clear screen mode(0X100000b)
        uint8_t command = SHARP_LCD_CMD_CHANGE_VCOM;
        //COM inversion bit
        command = command ^ VCOMbit;

        HAL_LCD_setCS();

        HAL_LCD_writeCommandOrData(command);
        HAL_LCD_writeCommandOrData(SHARP_LCD_TRAILER_BYTE);

        // Wait for last byte to be sent, then drop SCS
        HAL_LCD_waitUntilLcdWriteFinish();

        // Ensure a 2us min delay to meet the LCD's thSCS
        __delay_cycles(SYSTEM_CLOCK_SPEED * 0.000002);

        HAL_LCD_clearCS();
    }

    flagSendToggleVCOMCommand = SHARP_SEND_TOGGLE_VCOM_COMMAND;
}

void Sharp96x96_disable(void)
{
    HAL_LCD_disableDisplay();
}

void Sharp96x96_enable(void)
{
    HAL_LCD_enableDisplay();
}

//*******************************************************************************
//
//! Reverses the bit order.- Since the bit reversal function is called
//! frequently by the several driver function this function is implemented
//! to maximize code execution
//
//*******************************************************************************
static uint8_t Sharp96x96_reverse(uint8_t x)
{
    uint8_t b = 0;

