PiBoxY/msp430ware/examples/boards/MSP-EXP430FR5994/MSP-EXP430FR5994_Software_Examples/Firmware/Source/BOOSTXL-AUDIO_430BOOST-SHARP96_FFT_FIR_LEA_MSP430FR5994/src/grlib/LcdDriver/Sharp96x96.c
            //write middle bytes
            for(xi = x_index_min; xi < x_index_max - 1; xi++)
            {
                *pucData++ = 0x00;
            }

            //write last byte
            *pucData &= ~uclast_x_byte;
        }
        //white pixels (set bits)
        else
        {
            //write first byte
            *pucData++ |= ucfirst_x_byte;

            //write middle bytes
            for(xi = x_index_min; xi < x_index_max - 1; xi++)
            {
                *pucData++ = 0xFF;
            }

            //write last byte
            *pucData |= uclast_x_byte;
        }
    }
    //only one data byte
    else
    {
        //calculate value of single byte
        ucfirst_x_byte &= uclast_x_byte;

        //set buffer to correct location
        pucData = &DisplayBuffer[lY][x_index_min];

        //draw black pixels (clear bits)
        if(ClrBlack == ulValue)
        {
            *pucData++ &= ~ucfirst_x_byte;
        }
        //white pixels (set bits)
        else
        {
            *pucData++ |= ucfirst_x_byte;
        }
    }

#ifdef NON_VOLATILE_MEMORY_BUFFER
    HAL_LCD_finishMemoryWrite();
#endif
}

//*****************************************************************************
//
//! Draws a vertical line.
//!
//! \param pvDisplayData is a pointer to the driver-specific data for this
//! display driver.
//! \param lX is the X coordinate of the line.
//! \param lY1 is the Y coordinate of the start of the line.
//! \param lY2 is the Y coordinate of the end of the line.
//! \param ulValue is the color of the line.
//!
//! This function draws a vertical line on the display.  The coordinates of the
//! line are assumed to be within the extents of the display.
//!
//! \return None.
//
//*****************************************************************************
static void Sharp96x96_LineDrawV(void *pvDisplayData,
                                 int16_t lX,
                                 int16_t lY1,
                                 int16_t lY2,
                                 uint16_t ulValue)
{
    uint16_t yi = 0;
    uint16_t x_index = lX >> 3;
    uint8_t data_byte;

#ifdef NON_VOLATILE_MEMORY_BUFFER
    HAL_LCD_prepareMemoryWrite();
#endif

    //calculate data byte
    //mod by 8 and shift this # bits
    data_byte = (0x80 >> (lX & 0x7));

    //write data to the display buffer
    for(yi = lY1; yi <= lY2; yi++)
    {
        //black pixels (clear bits)
        if(ClrBlack == ulValue)
        {
            DisplayBuffer[yi][x_index] &= ~data_byte;
        }
        //white pixels (set bits)
        else
        {
            DisplayBuffer[yi][x_index] |= data_byte;
        }
    }

#ifdef NON_VOLATILE_MEMORY_BUFFER
    HAL_LCD_finishMemoryWrite();
#endif
}

//*****************************************************************************
//
//! Fills a rectangle.
//!
//! \param pvDisplayData is a pointer to the driver-specific data for this
//! display driver.
//! \param pRect is a pointer to the structure describing the rectangle.
//! \param ulValue is the color of the rectangle.
//!
//! This function fills a rectangle on the display.  The coordinates of the
//! rectangle are assumed to be within the extents of the display, and the
//! rectangle specification is fully inclusive (in other words, both sXMin and
//! sXMax are drawn, along with sYMin and sYMax).
//!
//! \return None.
//
//*****************************************************************************
static void Sharp96x96_RectFill(void *pvDisplayData,
                                const Graphics_Rectangle *pRect,
                                uint16_t ulValue)
{
    uint16_t xi = 0;
    uint16_t yi = 0;
    uint16_t x_index_min = pRect->sXMin >> 3;
    uint16_t x_index_max = pRect->sXMax >> 3;
    uint8_t *pucData, ucfirst_x_byte, uclast_x_byte;

#ifdef NON_VOLATILE_MEMORY_BUFFER
    HAL_LCD_prepareMemoryWrite();
#endif

    //calculate first byte
    //mod by 8 and shift this # bits
    ucfirst_x_byte = (0xFF >> (pRect->sXMin & 0x7));

    //calculate last byte
    //mod by 8 and shift this # bits
    uclast_x_byte = (0xFF << (7 - (pRect->sXMax & 0x7)));

    //check if more than one data byte
    if(x_index_min != x_index_max)
    {
        //write bytes
        for(yi = pRect->sYMin; yi <= pRect->sYMax; yi++)
        {
            //set buffer to correct location
            pucData = &DisplayBuffer[yi][x_index_min];

            //black pixels (clear bits)
            if(ClrBlack == ulValue)
            {
                //write first byte
                *pucData++ &= ~ucfirst_x_byte;

                //write middle bytes
                for(xi = x_index_min; xi < x_index_max - 1; xi++)
                {
                    *pucData++ = 0x00;
                }

                //write last byte
                *pucData &= ~uclast_x_byte;
            }
            //white pixels (set bits)
            else
            {
                //write first byte
                *pucData++ |= ucfirst_x_byte;

                //write middle bytes
                for(xi = x_index_min; xi < x_index_max - 1; xi++)
                {
                    *pucData++ = 0xFF;
                }

                //write last byte
                *pucData |= uclast_x_byte;
            }
        }
    }
    //only one data byte
    else
    {
        //calculate value of single byte
        ucfirst_x_byte &= uclast_x_byte;

        //set buffer to correct location
        pucData = &DisplayBuffer[pRect->sYMin][x_index_min];

        //black pixels (clear bits)
        if(ClrBlack == ulValue)
        {
            *pucData++ &= ~ucfirst_x_byte;
        }
        //white pixels (set bits)
        else
        {
            *pucData++ |= ucfirst_x_byte;
        }
    }

#ifdef NON_VOLATILE_MEMORY_BUFFER
    HAL_LCD_finishMemoryWrite();
#endif
}

//*****************************************************************************
//
//! Translates a 24-bit RGB color to a display driver-specific color.
//!
//! \param pvDisplayData is a pointer to the driver-specific data for this
//!   display driver
//! \param ulValue is the 24-bit RGB color.  The least-significant byte is the
//!   blue channel, the next byte is the green channel, and the third byte is
//!   the red channel.
//!
//! This fucntion translates a 24-bit RGB color into a value that can be written
//! into the display's frame buffer in order to reproduce that color, or the
//! closest possible approximation of that color. This particular driver
//! requires the 8-8-8 24 bit RGB color to convert into mono color
//! 1 = White, 0 = Black
//!
//! \return Returns the display-driver specific color
//
//*****************************************************************************
static uint32_t Sharp96x96_ColorTranslate(void *pvDisplayData,
                                          uint32_t ulValue)
{
    //
    // Translate from a 24-bit RGB color to mono color.
    //
    return(((ulValue != 0) ? ulValue = 1 : ulValue));
}

//*****************************************************************************
//
//! Flushes any cached drawing operations.
//!
//! \param pvDisplayData is a pointer to the driver-specific data for this
//! display driver.
//!
//!
//! This functions flushes any cached drawing operations to the display.  This
//! is useful when a local frame buffer is used for drawing operations, and the
//! flush would copy the local frame buffer to the display.
//!
//! \return None.
//
//*****************************************************************************
static void Sharp96x96_Flush(void *pvDisplayData)
{
    uint8_t *pucData = &DisplayBuffer[0][0];
    int32_t xi = 0;
    int32_t xj = 0;
    //image update mode(1X000000b)
    uint8_t command = SHARP_LCD_CMD_WRITE_LINE;

    //COM inversion bit
    command = command ^ VCOMbit;

    HAL_LCD_setCS();

    HAL_LCD_writeCommandOrData(command);
    flagSendToggleVCOMCommand = SHARP_SKIP_TOGGLE_VCOM_COMMAND;
#ifdef LANDSCAPE
    for(xj = 0; xj < LCD_VERTICAL_MAX; xj++)
    {
        HAL_LCD_writeCommandOrData(Sharp96x96_reverse(xj + 1));

        for(xi = 0; xi < (LCD_HORIZONTAL_MAX >> 3); xi++)
        {
            HAL_LCD_writeCommandOrData(*(pucData++));
        }
        HAL_LCD_writeCommandOrData(SHARP_LCD_TRAILER_BYTE);
    }
#endif
#ifdef LANDSCAPE_FLIP
    pucData =
        &DisplayBuffer[LCD_VERTICAL_MAX - 1][(LCD_HORIZONTAL_MAX >> 3) - 1];

    for(xj = 1; xj <= LCD_VERTICAL_MAX; xj++)
    {
        HAL_LCD_writeCommandOrData(Sharp96x96_reverse(xj));

        for(xi = 0; xi < (LCD_HORIZONTAL_MAX >> 3); xi++)
        {
            HAL_LCD_writeCommandOrData(Sharp96x96_reverse(*pucData--));
        }
        HAL_LCD_writeCommandOrData(SHARP_LCD_TRAILER_BYTE);
    }
#endif

    HAL_LCD_writeCommandOrData(SHARP_LCD_TRAILER_BYTE);

    // Wait for last byte to be sent, then drop SCS
    HAL_LCD_waitUntilLcdWriteFinish();

